data = {
    '1':['Go','600','1,600','2,202'],
    '2':['Scala','600','1,300','1,489'],
    '3':['Python','575.1','1,499','9,344'],
    '4':['Kotlin','575','1.200','961'],
    '5':['TypeScript','575','1,200','667'],
    '6':['R','574.8','1,000','220'],
    '7':['Ruby','550','1,200','11,676'],
    '8':['Swift','550','1,200','3,353'],
    '9':['Perl','525','1,200','4,509'],
    '10':['C','525','1,000','9,347']
}

list_ = []

for k in data.keys():
    list_.append(int(data[k][-1].replace(",", "")))

total = sum(list_)
print('順位,言語,年収中央値(万円),最大提示年収(万円),求人数,パーセント')
for k in data.keys():
    str_ = ','.join(data[k])
    int_ = int(data[k][-1].replace(",", ""))
    per = int_/total
    print(k + ',' + str_ + ',' + '{:.2%}'.format(per))